<template>
  <div class="page">
    <div class="container">
      <h1>熊猫易租房 - 您的理想居住解决方案专家</h1>
      <p
        >欢迎来到熊猫易租房，我们是一家专注于为海外留学生提供全方位租房和买房服务的互联网公司。我们的使命是让每一位留学生在异国他乡找到温馨的家，享受无忧的生活体验。</p
      >
      <p>在熊猫易租房，我们深知留学生在海外生活的挑战，特别是在寻找合适的住宿方面。因此，我们提供了一系列定制化的服务，包括但不限于：</p>
      <ul>
        <li
          ><strong>个性化租房服务</strong
          >：我们的专业团队会根据您的需求和预算，为您筛选最合适的房源。无论是靠近校园的公寓，还是交通便利的社区住宅，我们都能为您提供详尽的信息和专业的建议。</li
        >
        <li
          ><strong>买房咨询服务</strong
          >：对于有长期居住或投资需求的留学生，我们提供全面的买房咨询服务。从市场分析到物业选择，再到交易流程，我们的专家将全程陪伴，确保您的投资安全且回报最大化。</li
        >
        <li
          ><strong>法律和财务咨询</strong
          >：我们与澳大利亚当地的法律和财务专家合作，为您提供必要的法律咨询和财务规划服务，确保您的租房或买房过程合法、透明。</li
        >
        <li
          ><strong>生活支持服务</strong
          >：除了住宿服务，我们还提供一系列生活支持服务，如语言培训、文化适应指导等，帮助您更快融入当地生活。</li
        >
      </ul>
      <p
        >在熊猫易租房，我们承诺提供高质量的服务，确保您的留学生活从找到理想的家开始就充满安心和舒适。我们的团队随时准备回答您的任何疑问，并提供所需的帮助。选择熊猫易租房，让我们成为您在澳大利亚的可靠伙伴！</p
      >
    </div>
  </div>
</template>

<script lang="ts" setup name="LoginPage"></script>

<style scoped lang="scss">
  .page {
    padding: 20px;
  }
</style>
