<template>
  <div class="page">
    <p style="text-align: center"><strong>熊猫易租房房屋租赁合同</strong></p>
    <p style="text-align: center"><strong>房屋租赁合同</strong></p>
    <p>合同编号：{{ route.params.contractNo }}</p>
    <p>&nbsp;</p>
    <p><strong>签约提示：</strong></p>
    <ol>
      <li>合同生效时间：本合同自个人租客支付完成首笔款之日起生效。</li>
      <li>本合同所述所有期限起算日均包含当日。</li>
      <li>熊猫易租房有权将承租人在履行本合同期间发生的信用行为同步至中国政府信用平台。</li>
      <li
        >熊猫易租房有权依法将承租人的个人信息及本合同所有内容上传至政府指定部门或机构，以履行法律法规规定的各项义务（包括但不限于网签、租赁备案等）。</li
      >
    </ol>
    <p>&nbsp;</p>
    <p>出租人：{{ route.params.landlord }}</p>
    <p>出租人手机号：{{ route.params.landlordPhone }}</p>
    <p>出租人身份证号：{{ route.params.landlordIdCard }}</p>
    <p><br />承租人：{{ route.params.tenant }}</p>
    <p>承租人手机号：{{ route.params.tenantPhone }}</p>
    <p>承租人身份证号：{{ route.params.tenantIdCard }}</p>
    <p><br />资产管理人（简称&ldquo;熊猫易租房&rdquo;）：（受出租人委托）上海慧霞商贸有限公司</p>
    <p><strong>第一条 房屋租赁信息及交付</strong></p>
    <p
      >（一） 房屋坐落：{{ route.params.address }} ， 房屋户型：{{ route.params.houseType }}， 租赁用途为居住。租赁期间：{{
        route.params.leaseDate
      }}
      。</p
    >
    <p
      >（二） 本合同签订并支付首笔款后，承租人应在到达澳大利亚后的 48
      小时内，和熊猫易租房工作人员一同来到租住现场确认交割物品：如钥匙、床、洗衣机等家具，并随后在熊猫易租房小程序内完成物业交割确认，超时未确认的，视为承租人认可物业交割信息并已接收房屋。</p
    >
    <p>（三） 物业交割确认后，熊猫易租房工作人员向承租人交付房屋钥匙。</p>
    <p><strong>第二条 各方权利义务</strong></p>
    <p
      >（一）熊猫易租房已获房屋资产出租人授权，在授权期间内为出租人提供设计及装修服务，使房屋以达到熊猫易租房的房屋品质要求、代出租人寻找租客、签署房屋租赁合同、交接房屋、维修管理房屋、收取房屋资产管理收益，维护房屋的合法权益及资产不受损失。</p
    >
    <p>（二）熊猫易租房为承租人寻找适租房源、确保资金安全、提供保洁、维修服务等配套服务。</p>
    <p>（三） 为了维护承租人安全，需经过与承租人友好沟通后，熊猫易租房才有权进入房屋提供服务、检查、维修或展示房源。</p>
    <p><strong>第三条 房屋租金、押金、服务费及生活费用 </strong></p>
    <p
      >（一）受房屋出租人委托，由熊猫易租房代为收取房租、押金，本合同租金、押金、服务费及付款方式以合同<strong>附件五</strong>载明内容为准。</p
    >
    <p>（二）承租人续租、换租或转租房屋的，租金以届时熊猫易租房和出租人商定的报价为准。</p>
    <p>（三）生活水电费：</p>
    <ol>
      <li>租赁期限内，承租人需配合甲方熊猫易租房定期上门查表（包括但不限于协助熊猫易租房拍摄示数照片）。</li>
      <li
        >后付费的生活费用由熊猫易租房定期生成相应账单，承租人应及时支付。预付费的生活费用，
        承租人应根据实际使用情况自行合理购买，并及时与房屋其他实际使用人结清，否则造成的损失和后果由承租人自行承担。</li
      >
      <li
        >非出租人及熊猫易租房原因导致无法上门查表或生活费用收费单位未定时生成相应账单的，熊猫易租房有权代出租人通过预估的形式生成生活费用账单，后期按照承租人的实际使用情况多退少补。</li
      >
      <li>本合同约定的生活费用单价仅供参考，具体以实际收费标准为准。</li>
    </ol>
    <p><strong>第四条 房屋维护与维修</strong></p>
    <p
      >（一）
      熊猫易租房受出租人委托，如房屋及原有物品、设备设施在租赁期限内因老化产生的维护、维修事宜由熊猫易租房承担；如发生人为损坏的，应按照附件三及物业交割补充协议的标准进行赔偿或维修；若附件三及物业交割补充协议未有明确约定的，依据&ldquo;谁导致谁承担&rdquo;的原则处理。</p
    >
    <p
      >（二）
      租赁期限内，承租人对房屋具有一般性保管义务，如有房屋设施设备损毁或发生故障情况，应及时通知熊猫易租房，否则由此造成的财产损失、人身损害等由承租人承担。</p
    >
    <p><strong>第五条 换租</strong></p>
    <p
      >（二） 本合同生效后，经协商一致，承租人可换租至熊猫易租房管理的其他房屋（换租不支持由整租换成非整租产品
      ）。承租人应先与该房屋的出租人就拟换租的房屋签订租赁期限不少于半年的租赁合同，该合同起租后3日内（不含 3
      日，含起租日当日）应办理本合同的退租手续，否则熊猫易租房有权拒绝办理换租。本合同租金计算至退租完成日。</p
    >
    <p>（三） 换租的，承租人应向熊猫易租房支付月租金 50%的违约金。</p>
    <p>（四） 承租人若同时签订多份租赁合同，同一房屋仅能接受一次被换入。</p>
    <p><strong>第六条 合同的解除及终止</strong></p>
    <p
      >（一） 出现下列情形之一的，本合同自动解除，双方互不承担违约责任：
      因出现自然灾害、拆迁、需要入户配合的市政改造（外墙及社区环境改造除外）等情形，
      或因政府机构行为、第三方行为等非熊猫易租房及承租方行为导致现有房屋户型变化的，或因熊猫易租房不再享有出租管理权限，导致本合同无法继续履行的。</p
    >
    <p
      >（二） 起租日前，提前一日通知；起租日后，提前 15 日通知，并按本合同月租金 100%
      的标准支付违约金的，任何一方可提前解除合同。承租人应提前 15 日在熊猫易租房客户端提交解约申请，申请日后的第 15
      日为解约日，租金计算至解约日，承租人有权要求熊猫易租房在解约日前办理房屋交割并搬离房屋；若承租人办理房屋交割日超过申请日后 15 日的，
      则承租人租金计算至房屋交割日，该交割日为双方解约日。</p
    >
    <p>（三） 出现下列情形之一的，承租人有权单方解除合同：</p>
    <ol>
      <li>因出租人或熊猫易租房原因延迟交付房屋达七日（承租人已接受房屋交付的除外）；</li>
    </ol>
    <p>（四） 出现下列情形之一的，熊猫易租房有权代出租人单方解除合同：</p>
    <ol>
      <li>承租人在租赁期限内拖欠租金、服务费或生活费用达七日的，或欠缴各项费用总和达月租金 15%的；</li>
      <li
        >承租人有以下行为之一的：（1） 危害房屋安全；（2） 将房屋擅自转租、交由他人居住或违反租住条件；（3）
        拒不配合熊猫易租房的经营管理活动；（4） 严重影响其他租户或相邻权人生活； （5）
        利用房屋从事违法活动。上述行为的具体情形包括但不限于附件四所列相应行为。</li
      >
      <li>其他承租人违反本合同约定，经熊猫易租房提出拒不改正或因承租人原因导致本合同无法继续履行的情形。</li>
    </ol>
    <p
      >（五）如本合同为续约合同，且签署日期在原房屋租赁合同到期日前的，承租人应在原房屋租赁合同到期日前支付完首笔款；续约合同签署日期在原房屋租赁合同到期日（含到期日当日）
      后的，承租人应在签约后的 48 小时内支付完首笔款。如承租人未在上述约定的期限内支付完首笔款的，需承担续约合同月租金的
      50%作为违约金，且续约合同自动解除。</p
    >
    <p
      >（六）
      本合同终止时，承租人需到房屋现场办理解约手续，同时承租人应保证将自有物品搬离，并将房屋及附属物品、设备设施恢复至原貌，且以完好状态交还熊猫易租房，除自然损耗外，
      若因承租人原因有损坏或丢失的，承租人应予以赔偿，具体赔付标准以附件三及物业交割补充协议所列为准。如本合同终止后，房屋内有承租人遗留物的，熊猫易租房有权自行处置。若熊猫易租房处置的承租人遗留的物品为大件物品（例
      如家具家电：床、床垫、衣柜、书桌、座椅、 梳妆台、空调、冰箱、洗衣机等）、或单件物品体积大于 1m3（例如塑料拼装衣柜、鞋柜、
      储物架等）、或需维修工人拆卸运出房间的物品（例如跑步机、动感单车、大型健身器材等）、
      或大件宠物用品（例如猫爬架、猫狗宠物笼子），包括但不限于以上举例情形，承租人需另行向熊猫易租房支付每件 80
      元的物品清运费。承租人确认熊猫易租房无需就上述处分行为承担任何赔偿责任。具体办理时间以双方协商一致为准，否则以熊猫易租房办理的解约单据为准。</p
    >
    <p
      >（七）
      如本合同提前终止，承租人退租日前未使用租期的租金及服务费，熊猫易租房代表出租人予以退还。承租人应缴未缴的费用，熊猫易租房有权从其他费用中直接抵扣，不足部分，承租人应在合同终止日按照生成的解约账单进行支付。其中涉及的租金部分，熊猫易租房与出租人自行结算。</p
    >
    <p><strong>第七条 违约责任</strong></p>
    <p>（一） 违约方有下列情形之一的，应按下述约定向守约方承担相应的违约责任：</p>
    <p
      >1.未按约定时间交付或返还房屋的，包括房屋内仍有承租人遗留物品未清空的，每逾期一个自然日，违约方应向守约方承担房屋日租金的
      100%的违约金（承租人需同时承担延迟返还房屋期间的租金、服务费及生活费用）。<br />2.
      承租人未按合同约定时间支付租金、押金、服务费、生活费用的，每逾期一个自然日，应 按照当期应付金额的千分之五/日的标准支付逾期违约金。<br />3.
      一方违反本合同之约定导致另一方解除合同的，违约方应向守约方支付房屋月租金的 100%的违约金（合同另有约定的除外）。</p
    >
    <p>（二） 根据本合同第六条第（二）款之规定，任何一方提前解除合同的，应向对方支付一个月租金的违约金。</p>
    <p>（三） 在续租合同起租日前 30 日起至起租日，一方要求解除续租合同的，违约方应向守约方支付续租合同月租金的 50%的违约金。</p>
    <p>（四）上述所有违约金已涵盖因提前终止合同产生的搬家费、赔偿金、补偿金等所有实际损失。</p>
    <p
      >（五） 根据第五条第（二）款之规定，如承租人与熊猫易租房就拟换租的房屋签订的租赁合同，承租人提前解约的且实际居住少于 90
      天的，承租人应承担月租金的 100%的违约金。</p
    >
    <p><strong>第八条 续约</strong></p>
    <p
      >如承租人意向续约的，应最晚于本合同租赁期限届满前 30
      日向熊猫易租房提出书面申请，经三方协商一致后，另行签署新的房屋租赁合同。如承租人未在上述期限届满前明确告知熊猫易租房续约的，视为承租人放弃优先续约权，熊猫易租房有权将本合同的房屋信息于熊猫易租房小程序公开展示，并代出租人与第三方签署租赁合同；如承租人未按合同约定的要求行使优先承租权的，承租人应承担由此产生的损失，包括熊猫易租房向第三方承租人赔偿的损失等。
      本合同为续约合同的，起租日前承租人有本合同第六条第（四）款约定的情形的，熊猫易租房有权替出租人解除原房屋租赁合同及本合同，承租人除按照原房屋租赁合同承担违约责任外，还应承担本合同第七条第（三）款的违约责任。</p
    >
    <p><strong>第九条 其他约定的事项</strong></p>
    <p
      >（一）
      承租人已享受的本合同涉及各类租约规则、优惠、促销活动的，如承租人提前解除合同，熊猫易租房仅退还承租人实际支付且未使用的费用。</p
    >
    <p>（二） 熊猫易租房无法通过承租人提供信息取得联系超过三日的，承租人授权熊猫易租房有权通过第三方机构获得承租人的联系信息。</p>
    <p>（三） 租赁期限内，任何第三方发出的任何通知或房屋发生改变的，承租人应及时通知熊猫易租房。</p>
    <p>（四） 承租人放弃房屋的优先购买权。</p>
    <p>（五） 本合同适用中国法律；如有争议，任何一方可将争议提交给房屋所在地人民法院通过诉讼解决。</p>
    <p>&nbsp;</p>
    <p>&nbsp;</p>
    <p><strong>签署区：</strong></p>
    <p>&nbsp;</p>
    <p>出租人：{{ route.params.landlord }}</p>
    <p>&nbsp;</p>
    <p>承租人：<img v-if="route.params.tenantSign" :src="route.params.tenantSign" alt="" class="tenantSign" /></p>
    <p>&nbsp;</p>
    <p>（以下无正文）</p>
    <p>熊猫易租房小程序二维码</p>
    <p>&nbsp;</p>
    <p>本合同附件如下，与本合同具有同等法律效力，详情如下：</p>
    <p>附件一： 房屋租赁信息表；</p>
    <p>附件二： 租客信息表；</p>
    <p>附件三： 承租人责任及维修项目列表；</p>
    <p>附件四： 个人信息授权书；</p>
    <p>附件五： 费用明细；&nbsp;</p>
    <p>资产管理人：上海慧霞商贸有限公司</p>
    <p>&nbsp;</p>
    <p><strong>附件一：房屋租赁信息表</strong></p>
    <table style="height: 143px" width="816">
      <tbody>
        <tr>
          <td style="width: 109.984px">房屋信息</td>
          <td style="width: 109.984px">房屋地址</td>
          <td style="width: 109.984px">{{ route.params.address }}</td>
          <td style="width: 109.984px">户型</td>
          <td style="width: 109.984px">{{ route.params.houseType }}</td>
          <td style="width: 109.984px">出租人</td>
          <td style="width: 110.094px">{{ route.params.landlord }}</td>
        </tr>
      </tbody>
    </table>
    <p>&nbsp;</p>
    <p><strong>附件二：租客信息表</strong></p>
    <p>&nbsp;（由于承租人提供信息错误造成的损失由承租人承担）&nbsp;</p>
    <table style="height: 214px" width="481">
      <tbody>
        <tr>
          <td style="width: 113.25px">姓名</td>
          <td style="width: 113.25px">{{ route.params.tenant }}</td>
          <td style="width: 113.25px">性别</td>
          <td style="width: 113.25px">&nbsp;</td>
        </tr>
        <tr>
          <td style="width: 113.25px">联系电话</td>
          <td style="width: 113.25px">{{ route.params.tenantPhone }}</td>
          <td style="width: 113.25px">职业</td>
          <td style="width: 113.25px">&nbsp;</td>
        </tr>
        <tr>
          <td style="width: 113.25px">紧急联系人</td>
          <td style="width: 113.25px">&nbsp;</td>
          <td style="width: 113.25px">紧急联系人电话</td>
          <td style="width: 113.25px">&nbsp;</td>
        </tr>
        <tr>
          <td style="width: 113.25px">电子邮箱</td>
          <td style="width: 113.25px">&nbsp;</td>
          <td style="width: 113.25px">&nbsp;</td>
          <td style="width: 113.25px">&nbsp;</td>
        </tr>
      </tbody>
    </table>
    <p><strong>附件三：承租人责任及维修项目列表</strong></p>
    <p>（一）承租人责任</p>
    <p>1、房屋及屋内物品出现下列损坏情形之一的，承租人应赔偿：</p>
    <p>（1）配件有缺失，外观有损坏，板材断裂；</p>
    <p>（2）外观破损直径&ge;3cm ，划痕&ge;10cm；</p>
    <p>（3）床垫有血渍、尿渍；或其他脏污累计最大直径之和&ge;10cm；</p>
    <p>（4）有动物抓挠、啃咬痕迹；</p>
    <p>（5）窗帘杆断裂、窗帘破损；</p>
    <p>（6）有污渍、有霉渍；</p>
    <p>（7）墙面或壁纸存在油污、严重发黄、人为因素导致墙皮脱落；或其他脏污最大直径&ge;3cm或数 量&ge;5处；</p>
    <p>（8）地板/地砖破损最大直径&ge;2cm或数量&ge;3处或面积&ge;1m&sup2;； （9）其他物品损坏影响使用的情形。</p>
    <p>2、折旧赔付规则：</p>
    <p
      >（1）若因承租人责任导致物品损坏，按已使用期限进行折旧赔偿。物品已使用期限为物品配置于房屋之日起至本合同退租日止，物品无配置日的以该房屋的收房日为配置日。</p
    >
    <p
      >（2）折旧赔偿额计算规则为：<br />如物品已使用期限&ge;1825天，折旧赔偿额=物品原价&times;5% ；
      如物品已使用期限&lt;1825天，折旧赔偿额=（物品原价&times;95%&divide;1825）&times;（1825&mdash;实际使用天数）。</p
    >
    <p>&nbsp;</p>
    <p><strong>附件四：个人信息授权书</strong></p>
    <p
      >特别提醒：为了维护您的权益，请在签署本授权书前，仔细阅读本授权书各条款（特别是黑体字条款），关注您在授权书中的权利、义务。您点击同意或确认即表明本授权书由您本人签署并生效。</p
    >
    <p
      >本人同意并向上海慧霞商贸有限公司 （下称&ldquo;熊猫易租房&rdquo;）授权如下：
      在进行追索逾期租金、押金、服务费、生活费用等债务时，熊猫易租房可将本人的身份信息、联络信息（包括：姓名、手机号、紧急联系人姓名/手机号、邮箱）及本人拖欠本合同项下的相关必要信息提供给熊猫易租房委托的第三方机构（包括但不限于律师事务所和第三方催收机构）。</p
    >
    <p
      >熊猫易租房会严格督促委托的第三方机构妥善保管、保密和谨慎使用前述信息，要求其不得用作委托追索逾期债务以外的其他用途，以及不得以任何违法的方式追索债务。</p
    >
    <p
      >本人在此确认：在同意或授权熊猫易租房及其委托的第三方机构使用本授权书约定之个人信息之前，本人已经理解并知悉提供该等信息可能会对本人产生的不利后果（例如，第三方通过该等信息对本人的财产状况进行判断，可能对本人作出负面性评价）。</p
    >
    <p>&nbsp;</p>
    <p><strong>附件五：费用明细</strong></p>
    <p
      >&nbsp;1、熊猫易租房平台方为出租人和承租人提供在线撮合服务，此外平台系统可以提供自动记账、便捷换汇、贴心转租、房屋维修等服务，能够安全保障出租人和承租人的合伙权益。</p
    >
    <p
      >2、熊猫易租房提供熊猫易租房自营房源每月一次公区保洁（精选业主直租除外）。如非熊猫易租房原因导致的无法按时提供服务的，此期间费用无需退还。&nbsp;</p
    >
    <table style="height: 380px" width="866">
      <tbody>
        <tr>
          <td style="width: 209.5px">租赁期限</td>
          <td style="width: 209.5px">{{ route.params.leaseDate }}</td>
          <td style="width: 209.5px">入住日期</td>
          <td style="width: 209.5px">{{ route.params.checkInDate }}</td>
        </tr>
        <tr>
          <td style="width: 209.5px">费用期数</td>
          <td style="width: 209.5px">{{ route.params.feePeriod }}</td>
          <td style="width: 209.5px">租金/每期</td>
          <td style="width: 209.5px">{{ route.params.fee }}</td>
        </tr>
        <tr>
          <td style="width: 209.5px">服务费/每期</td>
          <td style="width: 209.5px">{{ route.params.serviceFee }}</td>
          <td style="width: 209.5px">押金</td>
          <td style="width: 209.5px">{{ route.params.deposit }}</td>
        </tr>
        <tr>
          <td style="width: 209.5px">付款方式</td>
          <td style="width: 209.5px">{{ route.params.paymentMethod }}</td>
          <td style="width: 209.5px">优惠金额</td>
          <td style="width: 209.5px">自动计算</td>
        </tr>
        <tr>
          <td style="width: 209.5px">&nbsp;</td>
          <td style="width: 209.5px">&nbsp;</td>
          <td style="width: 209.5px">&nbsp;</td>
          <td style="width: 209.5px">&nbsp;</td>
        </tr>
        <tr>
          <td style="width: 209.5px">&nbsp;</td>
          <td style="width: 209.5px">&nbsp;</td>
          <td style="width: 209.5px">&nbsp;</td>
          <td style="width: 209.5px">&nbsp;</td>
        </tr>
        <tr>
          <td style="width: 209.5px">&nbsp;</td>
          <td style="width: 209.5px">&nbsp;</td>
          <td style="width: 209.5px">&nbsp;</td>
          <td style="width: 209.5px">&nbsp;</td>
        </tr>
        <tr>
          <td style="width: 209.5px">&nbsp;</td>
          <td style="width: 209.5px">&nbsp;</td>
          <td style="width: 209.5px">&nbsp;</td>
          <td style="width: 209.5px">&nbsp;</td>
        </tr>
        <tr>
          <td style="width: 209.5px">&nbsp;</td>
          <td style="width: 209.5px">&nbsp;</td>
          <td style="width: 209.5px">&nbsp;</td>
          <td style="width: 209.5px">&nbsp;</td>
        </tr>
        <tr>
          <td style="width: 209.5px">&nbsp;</td>
          <td style="width: 209.5px">&nbsp;</td>
          <td style="width: 209.5px">&nbsp;</td>
          <td style="width: 209.5px">&nbsp;</td>
        </tr>
      </tbody>
    </table>
    <p>&nbsp;</p>
  </div>
</template>

<script lang="ts" setup name="LoginPage">
  import { useRoute } from 'vue-router';

  // contractNo 合同编号
  // 出租人 landlord
  // 出租人手机号 landlordPhone
  // 出租人身份证号 landlordIdCard
  // 承租人 tenant
  // 承租人手机号 tenantPhone
  // 承租人身份证号 tenantIdCard
  // 房屋坐落 address
  // 房屋户型 houseType
  // 租赁日期 leaseDate
  // 承租人签名图片 tenantSign
  // 入住日期 checkInDate
  // 多少期费用 feePeriod
  // 每期租金金额 fee
  // 每期服务费 serviceFee
  // 押金 deposit
  // 付款方式 paymentMethod
  const route = useRoute();
</script>

<style scoped lang="scss">
  .page {
    padding: 20px;

    .tenantSign {
      width: 300px;
      height: 150px;
    }
  }
</style>
