<template>
  <div class="page">
    <h1>服务协议</h1>

    <h2>1. 服务描述</h2>
    <p>平台通过软件提供租赁服务，帮助用户找到合适的房屋。用户可以在软件内支付相应费用，以获得平台提供的房屋搜索和匹配服务。</p>

    <h2>2. 用户权利和义务</h2>
    <p>
      2.1 用户应提供真实、准确、完整的个人信息，并保证其所提供的信息的合法性和有效性。<br />
      2.2 用户应按照平台的要求支付相应的费用，并确保支付信息的准确性。<br />
      2.3 用户应遵守相关法律法规和平台规定，不得利用本软件从事非法活动。<br />
      2.4 用户应妥善保管个人信息和账户密码，对于因用户保管不善导致的损失，平台不承担责任。
    </p>

    <h2>3. 平台责任和义务</h2>
    <p>
      3.1 平台应提供稳定、安全的软件服务，并及时处理用户的请求和投诉。<br />
      3.2 平台应保护用户的个人信息，不得将用户的个人信息泄露给第三方，除非获得用户的明确同意或法律法规另有规定。<br />
      3.3 平台不对用户的房屋选择和交易结果承担责任，仅提供房屋搜索和匹配服务。<br />
      3.4 平台有权根据业务需要对软件进行升级和优化，并可能会中断或限制部分服务，但应提前通知用户。
    </p>

    <h2>4. 支付和退款</h2>
    <p>
      4.1 用户在软件内支付费用后，费用将由平台代为保管，直到用户确认满意的房屋并完成交易。<br />
      4.2 如用户在软件内支付费用后未能找到满意的房屋，用户可以申请退款。平台将根据退款政策进行处理。
    </p>

    <h2>5. 知识产权</h2>
    <p>
      5.1 平台拥有本软件及相关服务的知识产权，包括但不限于软件的著作权、商标权等。<br />
      5.2 未经平台书面许可，用户不得擅自复制、修改、传播、展示或使用平台的知识产权。
    </p>

    <h2>6. 免责条款</h2>
    <p>
      6.1 用户应自行承担使用本软件的风险，平台不对用户因使用本软件而产生的任何直接或间接损失承担责任。<br />
      6.2 用户应自行判断房屋信息的真实性和合法性，平台不对房屋信息的准确性和合法性承担责任。
    </p>

    <h2>7. 协议变更和终止</h2>
    <p>
      7.1 平台有权根据业务需要随时修改本协议，并通过软件公告或其他方式通知用户。<br />
      7.2 用户有权随时终止使用本软件，但已支付的费用不予退还。<br />
      7.3 如用户违反本协议的约定，平台有权终止向用户提供服务，并有权追究用户的法律责任。
    </p>

    <h2>8. 法律适用和争议解决</h2>
    <p>本协议的解释、执行和争议解决均适用当地法律。如发生争议，应通过友好协商解决；协商不成的，应提交有管辖权的法院进行解决。</p>
  </div>
</template>

<script lang="ts" setup name="LoginPage"></script>

<style scoped lang="scss">
  .page {
    padding: 20px;
  }
</style>
